StrawHat-MonkeyDLuffy/nordic-safety-buckle/nRF5_SDK_17.1.0_ddde560/examples/My_project/ble_app_uart/main.c
/*
 * MC3635 installation limits.  These assume that the board is stationary
 * with Z aligned with gravity.  Record the values printed by
 * accelerometer_is_valid() on the installed product and tune these limits. (currenly set in maximum range for testing purpose as per range 2g = 2000mg)
 */
#define ACCEL_X_MIN_MG    (-2000)
#define ACCEL_X_MAX_MG    (2000)

#define ACCEL_Y_MIN_MG    (-2000)
#define ACCEL_Y_MAX_MG    (2000)

#define ACCEL_Z_MIN_MG    (-2000)
#define ACCEL_Z_MAX_MG    (2000)
/*
 * TEMPORARY:
 * BUTTON_1 is being used as the pressure-pad input.
 *
 * Replace BUTTON_1 with the actual pressure-pad GPIO
 * when your custom board definition is ready.
 */
#define PRESSURE_PAD_PIN           NRF_GPIO_PIN_MAP(1,6)


/* =========================================================
 * Timers
 * ========================================================= */

/* One-shot timer: defines the 10-second first-cycle duration */
APP_TIMER_DEF(m_first_cycle_timer);

/* Repeated timer: samples Hall during the first cycle */
APP_TIMER_DEF(m_hall_sample_timer);

/* Repeated timer: subsequent Hall + Accelerometer checks */
APP_TIMER_DEF(m_monitoring_timer);

/* =========================================================
 * Application States
 * ========================================================= */

typedef enum
{
    APP_STATE_SLEEP,
    APP_STATE_FIRST_CYCLE,
    APP_STATE_MONITORING,
    APP_STATE_BUZZER

} app_state_t;

/* =========================================================
 * Application Variables
 * ========================================================= */

static volatile bool m_first_cycle_timeout;
static volatile bool m_hall_sample_timeout;
static volatile bool m_monitoring_timeout;
static volatile bool m_pressure_event;
static app_state_t m_app_state = APP_STATE_SLEEP;

/* Kept globally because both initialization and the 10-second check use it. */
static TWI_parameters_t m_mc3635 =
{
    .SDA  = I2C_SDA_PIN,
    .SCL  = I2C_SCL_PIN,
    .ADDR = MC3635_ADDRESS_HIGH,
};

static bool m_accelerometer_ready;


static void first_cycle_timer_handler(void * p_context);
static void monitoring_timer_handler(void * p_context);
static void hall_sample_timer_handler(void * p_context);

/* =========================================================
 * Hall Sensor Sample Timer Handler
 *
 * Called every after 0.1 seconds.
 * ========================================================= */

static void hall_sample_timer_handler(void * p_context)
{
    (void)p_context;

    m_hall_sample_timeout = true;
}

/* =========================================================
 * First Cycle Timer Handler
 *
 * Called once after 10 seconds.
 * ========================================================= */

static void first_cycle_timer_handler(void * p_context)
{
    (void)p_context;

    m_first_cycle_timeout = true;
}


/* =========================================================
 * Monitoring Timer Handler
 *
 * Called every 10 seconds.
 * ========================================================= */

static void monitoring_timer_handler(void * p_context)
{
    (void)p_context;

    m_monitoring_timeout = true;
}

/* =========================================================
 * GPIO Interrupt Handler
 *
 * BUTTON_1 currently simulates the Pressure Pad.
 * ========================================================= */

static void pressure_pad_handler(
    nrf_drv_gpiote_pin_t pin,
    nrf_gpiote_polarity_t action)
{
    (void)pin;
    (void)action;

    /*
     * Pressure detected.
     *
     * Do not perform application processing here.
     * Just set a flag.
     */
    m_pressure_event = true;
}

/* =========================================================
 * Initialize GPIOTE
 * ========================================================= */

static void pressure_pad_init(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_gpiote_init();

    /*
     * NRF_ERROR_INVALID_STATE means
     * GPIOTE is already initialized.
     */
    if (err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
    }


    /*
     * HIGH -> LOW interrupt.
     *
     * Internal pull-up enabled.
     *
     * This is suitable for a button connected
     * between GPIO and GND.
     */
    nrf_drv_gpiote_in_config_t config =
        GPIOTE_CONFIG_IN_SENSE_HITOLO(true);

    config.pull = NRF_GPIO_PIN_PULLUP;


    APP_ERROR_CHECK(
        nrf_drv_gpiote_in_init(
            PRESSURE_PAD_PIN,
            &config,
            pressure_pad_handler
        )
    );


    nrf_drv_gpiote_in_event_enable(
        PRESSURE_PAD_PIN,
        true
    );
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    /*
     * First-cycle duration timer.
     *
     * One-shot:
     * expires after 10 seconds.
     */
    APP_ERROR_CHECK(
        app_timer_create(
            &m_first_cycle_timer,
            APP_TIMER_MODE_SINGLE_SHOT,
            first_cycle_timer_handler
        )
    );

    /*
     * Hall sampling timer.
     *
     * Repeated:
     * Hall is checked every 100 ms
     * during the first 10-second cycle.
     */
    APP_ERROR_CHECK(
        app_timer_create(
            &m_hall_sample_timer,
            APP_TIMER_MODE_REPEATED,
            hall_sample_timer_handler
        )
    );

