StrawHat-MonkeyDLuffy/nordic-safety-buckle/nRF5_SDK_17.1.0_ddde560/examples/My_project/ble_app_uart/main.c
    /*
     * Normal monitoring timer.
     *
     * Repeated:
     * Hall + accelerometer every 10 seconds.
     */
    APP_ERROR_CHECK(
        app_timer_create(
            &m_monitoring_timer,
            APP_TIMER_MODE_REPEATED,
            monitoring_timer_handler
        )
    );
}

/* =========================================================
 * Simulated Hall Sensor Check
 *
 * Later:
 * Replace this with PWM duty cycle measurement.
 * ========================================================= */

static bool hall_sensor_is_valid(void)
{
#if 0
    hall_sensor_measurement_t measurement;

    if (!hall_sensor_measurement_get(&measurement))
    {
        NRF_LOG_WARNING("No complete Hall PWM sample.");
        return false;
    }

    NRF_LOG_INFO("Hall PWM: %u.%u%%, period: %u ticks",
                 measurement.duty_per_mille / 10U,
                 measurement.duty_per_mille % 10U,
                 measurement.period_ticks);

    return (measurement.duty_per_mille >= HALL_DUTY_MIN_PER_MILLE) &&
           (measurement.duty_per_mille <= HALL_DUTY_MAX_PER_MILLE);
#endif
return true; 
}


/* =========================================================
 * MC3635 Accelerometer
 * ========================================================= */

static bool accelerometer_init(void)
{
    /* MC3635_Init configures the I2C peripheral only. */
    if (MC3635_Init(&m_mc3635) != MC3635_SUCCESS)
        return false;

    /* All device configuration writes must be made from standby mode. */
    if (MC3635_SetStandbyMode(&m_mc3635) != MC3635_SUCCESS ||
        MC3635_InitializationSequence(&m_mc3635) != MC3635_SUCCESS ||
        MC3635_EnableAxis(&m_mc3635,
                          MODE_C_X_AXIS_PD_ENABLED,
                          MODE_C_Y_AXIS_PD_ENABLED,
                          MODE_C_Z_AXIS_PD_ENABLED) != MC3635_SUCCESS ||
        MC3635_SetResolution(&m_mc3635, RANGE_C_RES_12_BITS) != MC3635_SUCCESS ||
        MC3635_SetRange(&m_mc3635, RANGE_C_RANGE_2G) != MC3635_SUCCESS ||
        MC3635_EnableFIFO(&m_mc3635, FIFO_C_FIFO_EN_DISABLED) != MC3635_SUCCESS)
    {
        return false;
    }

    ///* Keep fresh XYZ data available for each 10-second monitoring cycle. */
    //return MC3635_SetMode(&m_mc3635,
    //                      MODE_C_MCTRL_CWAKE,
    //                      LOW_POWER_MODE,
    //                      ODR_6) == MC3635_SUCCESS;
        return MC3635_SetSleepMode(&m_mc3635) == MC3635_SUCCESS;
}

//static bool accelerometer_is_valid(void)
//{
//    MC3635_data_t accel;

//    if (!m_accelerometer_ready)
//    {
//        NRF_LOG_ERROR("MC3635 is not initialized.");
//        return false;
//    }

//    if (MC3635_ReadRawData(&m_mc3635, &accel) != MC3635_SUCCESS)
//    {
//        NRF_LOG_ERROR("MC3635 read failed.");
//        return false;
//    }

//    NRF_LOG_INFO("Accel: X=%d mg, Y=%d mg, Z=%d mg",
//                 accel.XAxis_mg,
//                 accel.YAxis_mg,
//                 accel.ZAxis_mg);

//    bool valid =
//        (accel.XAxis_mg >= ACCEL_X_MIN_MG) &&
//        (accel.XAxis_mg <= ACCEL_X_MAX_MG) &&
//        (accel.YAxis_mg >= ACCEL_Y_MIN_MG) &&
//        (accel.YAxis_mg <= ACCEL_Y_MAX_MG) &&
//        (accel.ZAxis_mg >= ACCEL_Z_MIN_MG) &&
//        (accel.ZAxis_mg <= ACCEL_Z_MAX_MG);

//        return valid;

//}

static bool accelerometer_is_valid(void)
{
    MC3635_data_t accel;
    MC3635_data_t status;
    bool valid = false;

    if (!m_accelerometer_ready)
    {
        NRF_LOG_ERROR("MC3635 is not initialized.");
        return false;
    }

    /* Wake sensor. SetMode() must be called from STANDBY. */
    if (MC3635_SetStandbyMode(&m_mc3635) != MC3635_SUCCESS ||
        MC3635_SetMode(&m_mc3635,
                       MODE_C_MCTRL_CWAKE,
                       LOW_POWER_MODE,
                       ODR_6) != MC3635_SUCCESS)
    {
        NRF_LOG_ERROR("MC3635 wake failed.");
        return false;
    }

    /* Better than a fixed delay: wait until a fresh XYZ sample is available. */
    do
    {
        if (MC3635_ReadStatusRegister1(&m_mc3635, &status) != MC3635_SUCCESS)
        {
            NRF_LOG_ERROR("MC3635 status read failed.");
            goto sleep_sensor;
        }
    } while ((status.status_1 & STATUS_1_NEW_DATA_MASK) == 0);

    if (MC3635_ReadRawData(&m_mc3635, &accel) != MC3635_SUCCESS)
    {
        NRF_LOG_ERROR("MC3635 read failed.");
        goto sleep_sensor;
    }

    NRF_LOG_INFO("Accel: X=%d mg, Y=%d mg, Z=%d mg",
                 accel.XAxis_mg,
                 accel.YAxis_mg,
                 accel.ZAxis_mg);

     valid =
        (accel.XAxis_mg >= ACCEL_X_MIN_MG) &&
        (accel.XAxis_mg <= ACCEL_X_MAX_MG) &&
        (accel.YAxis_mg >= ACCEL_Y_MIN_MG) &&
        (accel.YAxis_mg <= ACCEL_Y_MAX_MG) &&
        (accel.ZAxis_mg >= ACCEL_Z_MIN_MG) &&
        (accel.ZAxis_mg <= ACCEL_Z_MAX_MG);

sleep_sensor:
    if (MC3635_SetSleepMode(&m_mc3635) != MC3635_SUCCESS)
    {
        NRF_LOG_ERROR("MC3635 sleep failed.");
    }

    return valid;
}
/* =========================================================
 * Enable Buzzer
 *
 * LED_1 is currently used to simulate the buzzer.
 * ========================================================= */

static void buzzer_enable(void)
{
    NRF_LOG_INFO("Buzzer enable");
    ///*
    // * Stop all sensor-cycle timers.
    // */
    //(void)app_timer_stop(m_first_cycle_timer);
    //(void)app_timer_stop(m_hall_sample_timer);
    //(void)app_timer_stop(m_monitoring_timer);

    ///*
    // * LED currently simulates buzzer.
    // */
    //bsp_board_led_on(0);

    m_app_state = APP_STATE_BUZZER;
}


/* =========================================================
 * Disable Buzzer
 * ========================================================= */

static void buzzer_disable(void)
{
    bsp_board_led_off(0);
}

/* =========================================================
 * Start First Cycle
 * ========================================================= */

static void start_first_cycle(void)
{
    m_pressure_event = false;

    m_first_cycle_timeout = false;
    m_hall_sample_timeout = false;

