StrawHat-MonkeyDLuffy/nordic-safety-buckle/nRF5_SDK_17.1.0_ddde560/examples/My_project/ble_app_uart/main.c
                  start_first_cycle();
              }
      
              break;
          }
      
      
          /* =================================================
           * FIRST CYCLE
           *
           * 0 - 10 seconds:
           *
           * Hall sensor is checked every 100 ms.
           * No accelerometer check yet.
           * ================================================= */
          case APP_STATE_FIRST_CYCLE:
          {
              /*
               * Hall sampling event.
               */
              if (m_hall_sample_timeout)
              {
                  m_hall_sample_timeout = false;
      
                  /*
                   * Read/check Hall sensor.
                   */
                  if (!hall_sensor_is_valid())
                  {
                      NRF_LOG_INFO(
                          "Hall sensor failed during first cycle."
                      );
      
                      buzzer_enable();
      
                      /*
                       * State is now APP_STATE_BUZZER.
                       * No further FIRST_CYCLE processing
                       * should be performed.
                       */
                      break;
                  }else{
                      NRF_LOG_INFO(
                          "Reading Hall sensor during first cycle."
                      );
                  
                  }
              }
      
      
              /*
               * First 10-second period completed.
               */
              if (m_first_cycle_timeout)
              {
                  m_first_cycle_timeout = false;
      
                  /*
                   * Stop 100 ms Hall sampling.
                   */
                  APP_ERROR_CHECK(
                      app_timer_stop(m_hall_sample_timer)
                  );
      
                  NRF_LOG_INFO(
                      "First 10-second cycle completed."
                  );
      
                  /*
                   * Start normal monitoring.
                   *
                   * Hall + Accelerometer
                   * every 10 seconds.
                   */
                  start_monitoring();
              }
      
              break;
          }
      
      
          /* =================================================
           * MONITORING STATE
           *
           * Every 10 seconds:
           *
           * 1. Read Hall
           * 2. Read Accelerometer
           * 3. Check both thresholds
           * ================================================= */
          case APP_STATE_MONITORING:
          {
              if (m_monitoring_timeout)
              {
                  m_monitoring_timeout = false;
      
                  NRF_LOG_INFO(
                      "Entering monitoring cycle."
                  );
      
                  bool hall_ok =
                      hall_sensor_is_valid();
      
                  bool accelerometer_ok =
                      accelerometer_is_valid();
      
      
                  if (hall_ok && accelerometer_ok)
                  {
                      /*
                       * Both sensors are OK.
                       *
                       * Return to sleep and wait
                       * for the next pressure interrupt.
                       */
                      NRF_LOG_INFO(
                          "Hall and accelerometer OK."
                      );
      
                  }
                  else
                  {
                      /*
                       * One or both sensors failed.
                       */
                      NRF_LOG_INFO(
                          "Sensor threshold failed."
                      );
      
                      buzzer_enable();
                  }
              }
      
              break;
          }
      
      
          /* =================================================
           * BUZZER STATE
           *
           * Buzzer remains ON until the required recovery
           * condition is detected.
           * ================================================= */
          case APP_STATE_BUZZER:
          {
              /*
               * Temporary:
               * Buzzer remains ON.
               *
               * Later:
               *
               * if (hall_detected_again ||
               *     motion_stopped ||
               *     pressure_removed)
               * {
               *     buzzer_disable();
               *     enter_sleep_state();
               * }
               */
      
              break;
          }
      
      
          /* =================================================
           * DEFAULT
           * ================================================= */
          default:
          {
              /*
               * Something corrupted the application state.
               * Return to a known safe state.
               */
              NRF_LOG_ERROR(
                  "Invalid application state: %d",
                  m_app_state
              );
      
              m_app_state = APP_STATE_SLEEP;
              break;
          }
      }
      
        idle_state_handle();
    }
}


/**
 * @}
 */
